class Simulation:

    """включает в себя:
    Карту
    Счётчик ходов
    Рендерер поля
    Actions - список действий, исполняемых перед стартом симуляции или на каждом ходу (детали ниже)"""

    def next_turn(self):

        """просимулировать и отрендерить один ход"""

        pass

    def start_simulation(self):

        """запустить бесконечный цикл симуляции и рендеринга"""

        pass

    def pause_simulation(self):

        """приостановить бесконечный цикл симуляции и рендеринга"""

        pass

